БИТУправление_медицинским_центром_демо/src/Documents/СправкаДляНалоговой/СправкаДляНалоговой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СправкаДляНалоговой</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Налогоплательщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>ИНН налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Для 2024+ периодов трактуется как сумма по коду 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоКоду2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуОказаныУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДУЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияДУЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДУЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиДУЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПациентЯвляетсяНалогоплательщиком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДатыОплаты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/СправкаДляНалоговой/Forms/ПроверкаПроданныхУслуг/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Продажи") Тогда
		
		Элементы.УслугиСКодом.Заголовок = "Услуги с кодом """ + Параметры.КодУслуги + """";
		
		ДеревоСКодомНоль = ДанныеФормыВЗначение(УслугиСКодомНоль, Тип("ДеревоЗначений"));
		ДеревоСИскомымКодом = ДанныеФормыВЗначение(УслугиСИскомымКодом, Тип("ДеревоЗначений"));
		
		Для Каждого Элемент Из Параметры.Продажи Цикл
			
			Если Элемент.Номенклатура.КодМедУслуги = 0 Тогда
				ДобавитьЭлементВДерево(ДеревоСКодомНоль, Элемент);	
			Иначе
				ДобавитьЭлементВДерево(ДеревоСИскомымКодом, Элемент);		
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВДанныеФормы(ДеревоСКодомНоль, УслугиСКодомНоль);
		ЗначениеВДанныеФормы(ДеревоСИскомымКодом, УслугиСИскомымКодом);
		
		УстановитьСнятьПометку(УслугиСИскомымКодом, Истина);
		Если Параметры.КодУслуги = 1 Тогда 
			УстановитьСнятьПометку(УслугиСКодомНоль, Истина);
		Иначе 
			УстановитьСнятьПометку(УслугиСКодомНоль, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УслугиСИскомымКодомПометкаПриИзменении(Элемент)

  ПометкаПриИзменении("УслугиСИскомымКодом")
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСКодомНольПометкаПриИзменении(Элемент)
	
	ПометкаПриИзменении("УслугиСКодомНоль");
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаПриИзменении(ИмяДерева)
	
	Родитель = Элементы[ИмяДерева].ТекущиеДанные.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		ПодчиненныеСтроки = Элементы[ИмяДерева].ТекущиеДанные.ПолучитьЭлементы();
		Для Каждого Строка Из ПодчиненныеСтроки Цикл 
			Строка.Пометка = Элементы[ИмяДерева].ТекущиеДанные.Пометка;	
		КонецЦикла;
	ИначеЕсли Элементы[ИмяДерева].ТекущиеДанные.Пометка Тогда
		Родитель.Пометка = Истина;
	Иначе
		ЭлементыРодителя = Родитель.ПолучитьЭлементы();
		Для Каждого ПодчиненныйЭлемент Из ЭлементыРодителя Цикл
			Если ПодчиненныйЭлемент.Пометка Тогда
				Возврат;	
			КонецЕсли;
		КонецЦикла;
		Родитель.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомадФормы

&НаКлиенте
Процедура ИскомыйКодОтметитьВсе(Команда)
	
	УстановитьСнятьПометку(УслугиСИскомымКодом, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскомыйКодСнятьВсе(Команда)
		
	УстановитьСнятьПометку(УслугиСИскомымКодом, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КодНольОтметитьВсе(Команда)
	
	УстановитьСнятьПометку(УслугиСКодомНоль, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура КодНольСнятьВсе(Команда)
	
	УстановитьСнятьПометку(УслугиСКодомНоль, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗакрыть(Команда)
	
	МассивВозврата = Новый Массив;
	ЗаполнитьМассивВозврата("УслугиСИскомымКодом", МассивВозврата);
	ЗаполнитьМассивВозврата("УслугиСКодомНоль", МассивВозврата);
	ЭтаФорма.Закрыть(МассивВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьЭлементВДерево(Дерево, Элемент)
	
	СтрокаШапки = Дерево.Строки.Найти(Элемент.Номенклатура, "Услуга");
	
	Если СтрокаШапки = Неопределено Тогда
		СтрокаШапки = Дерево.Строки.Добавить();
		СтрокаШапки.Услуга = Элемент.Номенклатура;
		СтрокаШапки.Количество = Элемент.Количество;
		СтрокаШапки.Сумма = Элемент.Сумма;
	Иначе
		СтрокаШапки.Количество = СтрокаШапки.Количество + Элемент.Количество;
		СтрокаШапки.Сумма = СтрокаШапки.Сумма + Элемент.Сумма;			
	КонецЕсли;
	
	ПодчиненнаяСтрока = СтрокаШапки.Строки.Добавить();
	ПодчиненнаяСтрока.Дата = Элемент.Период;
	ПодчиненнаяСтрока.Количество = Элемент.Количество;
	ПодчиненнаяСтрока.Сумма = Элемент.Сумма;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСнятьПометку(Дерево, Пометка)
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	
	Для Каждого Элемент Из ЭлементыДерева Цикл 
		
		Элемент.Пометка = Пометка;
		
		Для Каждого ПодчиненныйЭлемент Из Элемент.ПолучитьЭлементы() Цикл
			ПодчиненныйЭлемент.Пометка = Пометка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивВозврата(ИмяДерева, МассивВозврата)
	
		Для Каждого Строка Из ЭтотОбъект[ИмяДерева].ПолучитьЭлементы() Цикл
		Если Строка.Пометка Тогда
			Для Каждого ПодчиненнаяСтрока Из Строка.ПолучитьЭлементы() Цикл
				Если ПодчиненнаяСтрока.Пометка Тогда
					СтруктураЭлемента = Новый Структура;
					СтруктураЭлемента.Вставить("Номенклатура", Строка.Услуга);
					СтруктураЭлемента.Вставить("Период", ПодчиненнаяСтрока.Дата);
					СтруктураЭлемента.Вставить("Количество", ПодчиненнаяСтрока.Количество);
					СтруктураЭлемента.Вставить("Сумма", ПодчиненнаяСтрока.Сумма);
					
					МассивВозврата.Добавить(СтруктураЭлемента);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
